#小麦粉,小麦 搜索时间自定义
footmate_config = [{
    "信息来源": "食品伙伴网",
    "搜索条件": "小麦粉,小麦",
    "params": {
        "kw": '小麦粉,小麦',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1793：粮食及其制品-小麦粉
        "catidname": '1793',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 30,
    }
}


#大豆、黄豆 搜索时间自定义
,{
    "信息来源": "食品伙伴网",
    "搜索条件": "大豆,黄豆",
    "params": {
        "kw": '大豆,黄豆',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '2015-02-15',
        #1924：豆及豆制品-黄豆
        "catidname": '1924',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 30,
    }
}

#白砂糖 搜索时间自定义
,{
    "信息来源": "食品伙伴网",
    "搜索条件": "白砂糖",
    "params": {
        "kw": '白砂糖',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '2015-02-15',
        #1902：食糖
        "catidname": '1902',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 30,
    }
}

#淀粉 搜索时间自定义
,{
    "信息来源": "食品伙伴网",
    "搜索条件": "淀粉",
    "params": {
        "kw": '淀粉',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '2015-02-15',
        #1912：淀粉及淀粉制品
        "catidname": '1912',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 30,
    }
}

#味精 搜索时间自定义
,{
    "信息来源": "食品伙伴网",
    "搜索条件": "味精",
    "params": {
        "kw": '味精',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1804：调味品
        "catidname": '1804',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 30,
    }
}

#大蒜 搜索时间自定义
,{
    "信息来源": "食品伙伴网",
    "搜索条件": "大蒜",
    "params": {
        "kw": '大蒜',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1881：蔬菜及其制品
        "catidname": '1881',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 30,
    }
}

#氢氧化钠 搜索时间自定义
,{
    "信息来源": "食品伙伴网",
    "搜索条件": "氢氧化钠",
    "params": {
        "kw": '氢氧化钠',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1937： 食品添加剂
        "catidname": '1937',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 30,
    }
}


#芝麻油 搜索时间自定义
,{
    "信息来源": "食品伙伴网",
    "搜索条件": "芝麻油",
    "params": {
        "kw": '芝麻油',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1800,2015 食用植物油 餐饮用有
        "catidname": '1800,2015',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 30,
    }
}



#食用酒精 搜索时间自定义
,{
    "信息来源": "食品伙伴网",
    "搜索条件": "食用酒精",
    "params": {
        "kw": '食用酒精',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1879 酒类其他类
        "catidname": '1879',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 30,
    }
}


#陈醋 搜索时间自定义
,{
    "信息来源": "食品伙伴网",
    "搜索条件": "陈醋",
    "params": {
        "kw": '陈醋',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1806：调味品-食醋
        "catidname": '1806',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 30,
    }
}



#糖浆 搜索时间自定义
,{
    "信息来源": "食品伙伴网",
    "搜索条件": "糖浆",
    "params": {
        "kw": '糖浆',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1915：淀粉及淀粉制品-淀粉糖
        "catidname": '1915',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 30,
    }
}


#牡蛎 搜索时间自定义
,{
    "信息来源": "食品伙伴网",
    "搜索条件": "牡蛎",
    "params": {
        "kw": '牡蛎',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1908,2112 生鲜水产品 餐饮水产品
        "catidname": '1908,2112',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 30,
    }
}


#生蚝 搜索时间自定义
,{
    "信息来源": "食品伙伴网",
    "搜索条件": "生蚝",
    "params": {
        "kw": '生蚝',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1908,2112 生鲜水产品 餐饮水产品
        "catidname": '1908,2112',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 30,
    }
}


#贝类 搜索时间自定义
,{
    "信息来源": "食品伙伴网",
    "搜索条件": "贝类",
    "params": {
        "kw": '贝类',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1908,2112 生鲜水产品 餐饮水产品
        "catidname": '1908,2112',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 30,
    }
}
]

