#小麦粉,小麦 搜索时间自定义
footmate_config = [#贝类 搜索时间自定义
    {
    "信息来源": "食品伙伴网",
    "搜索条件": "",
    "params": {
        "kw": '',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '2',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1908,2112 生鲜水产品 餐饮水产品
        "catidname": '1842',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 30,
    }
},
{
    "信息来源": "食品伙伴网",
    "搜索条件": "",
    "params": {
        "kw": '',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1908,2112 生鲜水产品 餐饮水产品
        "catidname": '1938',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 15,
    }
},
{
    "信息来源": "食品伙伴网",
    "搜索条件": "",
    "params": {
        "kw": '',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1908,2112 生鲜水产品 餐饮水产品
        "catidname": '1936',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 15,
    }
}
,
{
    "信息来源": "食品伙伴网",
    "搜索条件": "",
    "params": {
        "kw": '',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1908,2112 生鲜水产品 餐饮水产品
        "catidname": '1923',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 15,
    }
}
,
{
    "信息来源": "食品伙伴网",
    "搜索条件": "",
    "params": {
        "kw": '',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1908,2112 生鲜水产品 餐饮水产品
        "catidname": '1912',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 15,
    }
}
,
{
    "信息来源": "食品伙伴网",
    "搜索条件": "",
    "params": {
        "kw": '',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1908,2112 生鲜水产品 餐饮水产品
        "catidname": '1907',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 15,
    }
}
,
{
    "信息来源": "食品伙伴网",
    "搜索条件": "",
    "params": {
        "kw": '',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1908,2112 生鲜水产品 餐饮水产品
        "catidname": '1894',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 15,
    }
}
,
{
    "信息来源": "食品伙伴网",
    "搜索条件": "",
    "params": {
        "kw": '',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1908,2112 生鲜水产品 餐饮水产品
        "catidname": '1874',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 15,
    }
}
,
{
    "信息来源": "食品伙伴网",
    "搜索条件": "",
    "params": {
        "kw": '',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1908,2112 生鲜水产品 餐饮水产品
        "catidname": '1982',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 15,
    }
}

,
{
    "信息来源": "食品伙伴网",
    "搜索条件": "",
    "params": {
        "kw": '',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1908,2112 生鲜水产品 餐饮水产品
        "catidname": '1804',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 15,
    }
}
,
{
    "信息来源": "食品伙伴网",
    "搜索条件": "",
    "params": {
        "kw": '',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1908,2112 生鲜水产品 餐饮水产品
        "catidname": '1799',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 15,
    }
}
,
{
    "信息来源": "食品伙伴网",
    "搜索条件": "",
    "params": {
        "kw": '',
        # 判断结果 '1'-合格 '2'-不合格 ''全部
        "hege": '',
        # 不合格原因 '1'-质量指标 '2'-微生物 ''-请选择（全选）
        "xmfl1": '',
        # 抽检级别 ''-全部 '1'-国抽 '2'-省抽
        "jibie": '',
        # 通报开始时间 ''
        "timebegin": '',
        # 通报结束时间
        "scrapy_end_time": '',
        #1908,2112 生鲜水产品 餐饮水产品
        "catidname": '1792',
        "page": 1,
        # 一次的搜索周期，单位天
        "addDay": 15,
    }
}
#1938,1936,1923,1912,1907,1902,1894,1874,1982,1804,1799,1792


]

